[
  {
    "image": "/assets/demo-app (1).webp",
    "title": "ChatMaster",
    "companyName": "TechNova",
    "id": 1,
    "description": "ChatMaster is an AI-powered chat app designed to revolutionize the way you communicate. It helps you stay connected and organized whether you’re chatting with colleagues, managing multiple group conversations, or collaborating on projects. Featuring advanced AI assistance, ChatMaster predicts responses, suggests message drafts, and even helps summarize lengthy discussions for quick understanding. With its clean and intuitive interface, the app ensures a smooth chatting experience with minimal distractions and maximum clarity.\n\nIn addition to smart messaging, ChatMaster includes end-to-end encryption for secure communication, a customizable workspace to prioritize important chats, and real-time translation to connect with anyone around the world. Its productivity-focused tools like reminders, task tagging, and integrated file sharing make it ideal for professionals and students alike. With ChatMaster, communication becomes not only faster but also smarter — turning every conversation into a step toward achieving more.",
    "size": 45,
    "reviews": 1200,
    "ratingAvg": 4.5,
    "downloads": 50000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 620 }
    ]
  },
  {
    "image": "/assets/FitTrack.webp",
    "title": "FitTrack",
    "companyName": "Healthify",
    "id": 2,
    "description": "FitTrack is your personal fitness companion designed to help you monitor, plan, and achieve your health goals effortlessly. Whether you're tracking daily steps, measuring calories burned, or logging workouts, FitTrack provides clear insights into your progress. The app supports multiple activity types, including running, cycling, yoga, and strength training, and offers real-time statistics to help you stay motivated and informed about your performance.\n\nBeyond activity tracking, FitTrack allows you to set personalized goals, track nutrition, and monitor sleep quality to ensure a balanced lifestyle. With progress charts, reminders, and expert tips, it keeps you on track and inspired every day. Its minimal yet intuitive interface makes it easy to view trends and celebrate milestones, empowering you to build healthier habits and reach your full potential.",
    "size": 60,
    "reviews": 850,
    "ratingAvg": 4.2,
    "downloads": 35000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 330 }
    ]
  },
  {
    "image": "/assets/Snap.jpg",
    "title": "PhotoSnap",
    "companyName": "SnapTech",
    "id": 3,
    "description": "PhotoSnap is your ultimate photography companion that lets you capture, edit, and share beautiful moments effortlessly. With a sleek interface and professional-grade tools, you can adjust lighting, apply filters, and enhance colors in just a few taps. The app is optimized for both beginners and photography enthusiasts, offering smart suggestions to improve composition and framing so that every shot stands out.\n\nBeyond editing, PhotoSnap allows you to organize your photo library, create stunning albums, and instantly share your creations on social media. AI-powered features like auto-enhance, background blur, and portrait touch-up help you achieve professional-quality results without the need for complex software. Whether you’re capturing travel memories or creating artistic portraits, PhotoSnap ensures every picture tells a story worth sharing.",
    "size": 80,
    "reviews": 940,
    "ratingAvg": 4.7,
    "downloads": 42000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 60 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 550 }
    ]
  },
  {
    "image": "/assets/demo-app (3).webp",
    "title": "TravelMate",
    "companyName": "Wanderlust Inc.",
    "id": 4,
    "description": "TravelMate is the ultimate travel planning app designed to make your trips seamless and memorable. It helps you discover destinations, compare accommodations, and book flights or hotels with ease — all in one place. The app provides personalized recommendations based on your preferences, ensuring every journey fits your style and budget. From weekend getaways to international adventures, TravelMate simplifies the entire travel experience.\n\nWhat sets TravelMate apart is its built-in itinerary builder and offline access, allowing you to organize your plans and access them anytime, anywhere. You can also explore curated guides, local attractions, and dining suggestions tailored to your location. With smart reminders, weather updates, and expense tracking, TravelMate ensures you’re always prepared. Whether you're an occasional traveler or a globe-trotter, this app is your perfect partner for stress-free exploration.",
    "size": 100,
    "reviews": 760,
    "ratingAvg": 4.3,
    "downloads": 28000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "/assets/Notewise.png",
    "title": "NoteWise",
    "companyName": "SmartApps",
    "id": 5,
    "description": "NoteWise helps you capture, organize, and manage your thoughts seamlessly. Whether it’s lecture notes, to-do lists, or creative ideas, NoteWise provides a clean and intuitive workspace to keep everything structured and accessible. You can create color-coded notebooks, add tags, and use smart search to instantly locate information whenever you need it. With cloud sync, your notes are always safe and available across all your devices.\n\nDesigned for students, professionals, and creators, NoteWise also supports voice notes, quick sketches, and collaborative sharing. You can easily attach images or files to your notes, making it a complete productivity companion. The minimal design and smooth navigation make writing and organizing a pleasure, helping you stay focused on what truly matters — your ideas.",
    "size": 35,
    "reviews": 670,
    "ratingAvg": 4.1,
    "downloads": 22000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 210 }
    ]
  },
  {
    "image": "/assets/Foodiefun.jpg",
    "title": "FoodieFun",
    "companyName": "YumCorp",
    "id": 6,
    "description": "FoodieFun is the ultimate app for anyone who loves exploring food. It lets you discover trending recipes, local restaurants, and exclusive food events in your area. From street food to gourmet dining, FoodieFun curates experiences based on your preferences and helps you connect with a community of passionate food lovers. You can also follow chefs, read reviews, and save your favorite spots to revisit later.\n\nThe app includes interactive recipe videos, step-by-step cooking guides, and filters for dietary preferences like vegan or gluten-free options. With FoodieFun, you can even organize your meal plans, share dishes with friends, and rate your dining experiences. It’s more than a recipe app — it’s your daily companion for culinary inspiration and unforgettable food adventures.",
    "size": 55,
    "reviews": 1020,
    "ratingAvg": 4.6,
    "downloads": 47000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 545 }
    ]
  },
  {
    "image": "/assets/LearnLang.jpg",
    "title": "LearnLang",
    "companyName": "EduTech",
    "id": 7,
    "description": "LearnLang transforms language learning into an engaging and interactive experience. Whether you’re a beginner or brushing up your fluency, it provides bite-sized lessons, quizzes, and pronunciation practice tailored to your pace. The app’s gamified approach keeps you motivated through streaks, badges, and rewards as you progress through different levels.\n\nWith support for multiple languages and AI-powered feedback, LearnLang helps you perfect speaking, listening, reading, and writing skills. You can connect with native speakers for practice and immerse yourself in real-world conversations through guided exercises. Its offline mode and daily reminders make consistent learning effortless, helping you master new languages with confidence.",
    "size": 70,
    "reviews": 880,
    "ratingAvg": 4.4,
    "downloads": 39000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 130 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 410 }
    ]
  },
  {
    "image": "/assets/MoneyMate.webp",
    "title": "MoneyMate",
    "companyName": "FinWise",
    "id": 8,
    "description": "MoneyMate helps you take control of your finances with clarity and ease. Track your expenses, set monthly budgets, and visualize your spending through detailed charts. The app automatically categorizes transactions, identifies spending patterns, and gives insights to help you save more effectively. With secure cloud backup, your financial data is always protected and accessible.\n\nIn addition to budgeting tools, MoneyMate includes features like bill reminders, income tracking, and goal planning for both short- and long-term savings. You can also generate expense reports and export them for personal or business use. Its intuitive interface and smart analytics make managing money less stressful and more empowering, helping you stay financially balanced every day.",
    "size": 40,
    "reviews": 950,
    "ratingAvg": 4.5,
    "downloads": 45000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 455 }
    ]
  },
  {
    "image": "/assets/AppMaster.png",
    "title": "AppMaster",
    "companyName": "TechLabs",
    "id": 9,
    "description": "AppMaster is your ultimate productivity companion designed to help you take full control of your daily tasks and goals. Whether you're managing work projects, study schedules, or personal habits, AppMaster ensures you stay on track with intuitive task management and performance tracking tools.\n\nWith a clean interface and intelligent reminders, you can prioritize what matters most and achieve more in less time. Its seamless synchronization across devices makes it easy to access your plans anywhere, ensuring that organization and efficiency go hand in hand.",
    "size": 50,
    "reviews": 1100,
    "ratingAvg": 4.6,
    "downloads": 48000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 530 }
    ]
  },
  {
    "image": "/assets/demo-app (6).webp",
    "title": "DailyPlanner",
    "companyName": "Noteify",
    "id": 10,
    "description": "DailyPlanner is a beautifully designed scheduling app that helps you organize your entire day effortlessly. From managing appointments and to-dos to setting reminders for important events, it simplifies how you plan and execute tasks.\n\nWith smart notifications and customizable layouts, DailyPlanner ensures your routine runs smoothly without missing a beat. It’s perfect for students, professionals, and anyone who wants to turn chaos into clarity while maintaining balance throughout the day.",
    "size": 30,
    "reviews": 950,
    "ratingAvg": 4.4,
    "downloads": 42000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 470 }
    ]
  },
  {
    "image": "/assets/PhotoEdit.png",
    "title": "PhotoEdit",
    "companyName": "Snapify",
    "id": 11,
    "description": "PhotoEdit lets you bring your creative vision to life with professional-grade photo editing tools in a user-friendly package. Whether you’re enhancing selfies, retouching landscapes, or designing social media content, PhotoEdit delivers stunning results with just a few taps.\n\nIt features filters, color correction tools, background removers, and AI-based enhancement to make every photo stand out. With its lightweight performance and offline editing capabilities, PhotoEdit gives you the power of a studio right in your pocket.",
    "size": 75,
    "reviews": 1050,
    "ratingAvg": 4.7,
    "downloads": 50000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 80 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 585 }
    ]
  },
  {
    "image": "/assets/TravelGuide.jpg",
    "title": "TravelGuide",
    "companyName": "WanderPro",
    "id": 12,
    "description": "TravelGuide transforms the way you explore new destinations by offering personalized travel plans, hidden gems, and essential information all in one app. From discovering attractions to reading local tips, TravelGuide helps you make every trip unforgettable.\n\nIt also features real-time navigation, itinerary tracking, and offline access to ensure you stay confident wherever your journey takes you. Whether you're a casual traveler or a frequent explorer, TravelGuide is your reliable travel companion around the world.",
    "size": 90,
    "reviews": 800,
    "ratingAvg": 4.3,
    "downloads": 35000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 290 },
      { "name": "5 star", "count": 490 }
    ]
  },
  {
    "image": "/assets/TaskMaster.jpg",
    "title": "TaskMaster",
    "companyName": "Productify",
    "id": 13,
    "description": "TaskMaster helps you conquer your to-do list with precision and ease. Designed for efficiency, it allows you to create, categorize, and prioritize tasks to stay focused and productive throughout the day.\n\nThe app’s clean design and smart scheduling make it easy to visualize progress, set deadlines, and avoid procrastination. From daily chores to long-term goals, TaskMaster is built to keep you motivated and in control of your time.",
    "size": 60,
    "reviews": 950,
    "ratingAvg": 4.5,
    "downloads": 47000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 455 }
    ]
  },
  {
    "image": "/assets/demo-app (5).webp",
    "title": "NoteMaster",
    "companyName": "NoteCraft",
    "id": 14,
    "description": "NoteMaster takes note-taking to a new level with intelligent features that keep your ideas organized and accessible. Whether you’re jotting down quick thoughts or structuring project outlines, it offers a clutter-free writing experience that boosts creativity.\n\nIt supports rich text formatting, voice notes, and syncing across devices, making it the perfect tool for students, creators, and professionals alike. With NoteMaster, you can transform scattered ideas into clear, actionable notes in seconds.",
    "size": 40,
    "reviews": 870,
    "ratingAvg": 4.2,
    "downloads": 42000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 370 }
    ]
  },
  {
    "image": "/assets/AppHub.webp",
    "title": "AppHub",
    "companyName": "TechWorks",
    "id": 15,
    "description": "AppHub is your one-stop destination for managing and discovering all your favorite apps in one convenient location. It brings together your most-used tools, productivity apps, and entertainment platforms into a sleek, organized interface that’s easy to navigate. Say goodbye to endless scrolling—AppHub ensures that every app you need is just a tap away.\n\nWith intelligent search, categorized sorting, and smart recommendations, AppHub helps you stay efficient while exploring new apps tailored to your interests. Whether you’re organizing your workspace or simplifying your phone’s layout, AppHub provides a seamless, modern experience for effortless access and discovery.",
    "size": 50,
    "reviews": 920,
    "ratingAvg": 4.6,
    "downloads": 48000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 455 }
    ]
  },
  {
    "image": "/assets/QuickLaunch.jpg",
    "title": "QuickLaunch",
    "companyName": "LaunchPad",
    "id": 16,
    "description": "QuickLaunch is designed to get you where you need to go—fast. It allows you to launch your most-used apps, shortcuts, and tools instantly, saving you time and reducing unnecessary taps. Its intuitive layout makes navigation smoother and keeps your screen clutter-free, focusing on simplicity and performance.\n\nThe app also supports customization, letting you group your apps by category or preference for even faster access. Whether you’re a multitasker or someone who values efficiency, QuickLaunch helps streamline your mobile experience so you can focus on what matters most.",
    "size": 35,
    "reviews": 800,
    "ratingAvg": 4.4,
    "downloads": 40000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 345 }
    ]
  },
  {
    "image": "/assets/AppBox.jpg",
    "title": "AppBox",
    "companyName": "Boxify",
    "id": 17,
    "description": "AppBox is the ultimate organizer for your digital life, neatly storing all your apps and tools in one easily accessible place. Its minimal yet powerful interface lets you categorize, favorite, and manage your installed apps with ease. No more hunting through pages—everything you need is inside your digital “box.”\n\nIt also features smart organization tools, automatic sorting, and performance insights to help you manage your storage and usage efficiently. AppBox isn’t just about convenience—it’s about giving you full control over your mobile ecosystem in a clean, user-friendly way.",
    "size": 60,
    "reviews": 950,
    "ratingAvg": 4.7,
    "downloads": 50000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 80 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 485 }
    ]
  },
  {
    "image": "/assets/AppmasterPro.jpg",
    "title": "AppMaster Pro",
    "companyName": "ProDev",
    "id": 18,
    "description": "AppMaster Pro takes productivity to the next level with advanced features designed for power users and professionals. Whether you’re managing complex projects, automating workflows, or tracking performance, this app provides a robust platform that adapts to your needs.\n\nIts customizable dashboards, priority tracking, and team collaboration tools make it ideal for those who demand more from their productivity apps. With a sleek design and top-tier performance, AppMaster Pro helps you work smarter, faster, and more effectively than ever.",
    "size": 70,
    "reviews": 1050,
    "ratingAvg": 4.8,
    "downloads": 55000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 60 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 665 }
    ]
  },
  {
    "image": "/assets/QuickAccess.webp",
    "title": "QuickAccess",
    "companyName": "Accessify",
    "id": 19,
    "description": "QuickAccess simplifies the way you interact with your apps and files, giving you instant access to everything that matters most. It’s built for speed and convenience, ensuring that your essential apps, documents, and folders are always just one tap away.\n\nThe app includes smart shortcuts, a customizable interface, and file search optimization to enhance your daily workflow. Whether you’re working, studying, or just browsing, QuickAccess ensures that everything you need is always within reach—no hassle, no delays.",
    "size": 45,
    "reviews": 900,
    "ratingAvg": 4.5,
    "downloads": 46000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 405 }
    ]
  },
  {
    "image": "/assets/AppSuite.webp",
    "title": "AppSuite",
    "companyName": "Suiteify",
    "id": 20,
    "description": "AppSuite is a powerful collection of productivity tools designed to help you manage your work, life, and creativity in one integrated platform. From notes and calendars to file sharing and reminders, AppSuite combines essential features into a cohesive, beautifully designed experience.\n\nWith cloud synchronization, team collaboration, and cross-device accessibility, AppSuite becomes your digital assistant for getting things done. It’s the perfect solution for professionals and students who value organization, flexibility, and efficiency—all wrapped in one modern suite.",
    "size": 80,
    "reviews": 1100,
    "ratingAvg": 4.6,
    "downloads": 52000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 575 }
    ]
  },
  {
    "image": "/assets/AppLauncher.webp",
    "title": "AppLauncher",
    "companyName": "Launchify",
    "id": 21,
    "description": "AppLauncher is the perfect solution for users who want instant access to their favorite apps without the hassle of searching or scrolling. Its minimalist design and lightning-fast performance ensure that you can launch any app on your device within seconds. With smart grouping and search functionality, AppLauncher adapts to your habits and keeps your most-used apps right at your fingertips.\n\nIt also supports widget shortcuts, gesture controls, and customization options, allowing you to create a launcher that fits your personal style. Whether you’re a multitasker or a minimalist, AppLauncher streamlines your mobile experience, helping you stay organized and efficient all day long.",
    "size": 55,
    "reviews": 980,
    "ratingAvg": 4.5,
    "downloads": 49000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 360 },
      { "name": "5 star", "count": 485 }
    ]
  },
  {
    "image": "/assets/CloudSync.png",
    "title": "CloudSync",
    "companyName": "SyncTech",
    "id": 22,
    "description": "CloudSync makes file synchronization effortless by keeping your data updated across all your devices in real-time. Whether you're working on a document, sharing photos, or managing backups, CloudSync ensures everything stays secure and accessible from anywhere. Its intuitive interface allows users to organize, upload, and restore files without any technical hassle.\n\nWith strong encryption, auto-sync scheduling, and cross-platform compatibility, CloudSync offers both convenience and reliability. It’s ideal for professionals, students, and anyone who values easy access to their digital workspace while maintaining privacy and security.",
    "size": 70,
    "reviews": 1020,
    "ratingAvg": 4.6,
    "downloads": 52000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 545 }
    ]
  },
  {
    "image": "/assets/FileManager.jpg",
    "title": "FileManager",
    "companyName": "FileTech",
    "id": 23,
    "description": "FileManager gives you full control over your device’s storage with a clean, efficient, and user-friendly interface. It allows you to browse, move, rename, and organize your files and folders effortlessly. With built-in search and sorting features, you can find anything in seconds, no matter how many files you have.\n\nThe app also includes features like file compression, secure folder locking, and cloud integration for enhanced flexibility. FileManager is your all-in-one solution for managing storage space effectively while keeping your device clutter-free and optimized for performance.",
    "size": 60,
    "reviews": 970,
    "ratingAvg": 4.5,
    "downloads": 48000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 515 }
    ]
  },
  {
    "image": "/assets/TaskTracker.png",
    "title": "TaskTracker",
    "companyName": "Trackify",
    "id": 24,
    "description": "TaskTracker helps you stay on top of your daily responsibilities with clear goal tracking and intuitive task management. You can set deadlines, categorize tasks, and monitor your progress all in one place. Whether it’s a work project, study schedule, or personal to-do list, TaskTracker keeps you motivated and productive throughout the day.\n\nThe app also offers reminders, analytics, and progress charts that give you insights into your productivity habits. With its smooth design and powerful features, TaskTracker is the perfect companion for those striving to achieve more with structure and focus.",
    "size": 50,
    "reviews": 940,
    "ratingAvg": 4.4,
    "downloads": 46000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 110 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 505 }
    ]
  },
  {
    "image": "/assets/NoteSync.png",
    "title": "NoteSync",
    "companyName": "Syncify",
    "id": 25,
    "description": "NoteSync ensures that your ideas and notes are always within reach—no matter where you are. It automatically syncs your notes across all your devices, making sure your latest updates are never lost. Whether you’re capturing quick thoughts, meeting notes, or creative ideas, NoteSync keeps everything organized and accessible.\n\nIt supports offline editing, folder organization, and smart search, making note-taking more seamless than ever. With NoteSync, you can focus on your thoughts instead of worrying about backups, syncing, or lost data—it’s note management made effortless.",
    "size": 40,
    "reviews": 910,
    "ratingAvg": 4.3,
    "downloads": 45000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 455 }
    ]
  },
  {
    "image": "/assets/BudgetBuddy.jpg",
    "title": "BudgetBuddy",
    "companyName": "FinTrack",
    "id": 26,
    "description": "BudgetBuddy by FinTrack is your ultimate financial companion, designed to help you manage your money with confidence. It offers an intuitive interface for tracking daily expenses, setting monthly budgets, and monitoring spending patterns. Whether you're saving for a trip, paying off debt, or just trying to understand where your money goes, BudgetBuddy keeps everything organized in one place.\n\nWith real-time analytics, spending insights, and customizable budget categories, BudgetBuddy empowers users to make smarter financial decisions. The app also syncs seamlessly across devices, ensuring your data stays up to date. Take control of your finances and watch your savings grow with BudgetBuddy — the smarter way to manage money.",
    "size": 55,
    "reviews": 980,
    "ratingAvg": 4.5,
    "downloads": 49000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 495 }
    ]
  },
  {
    "image": "/assets/demo-app (4).webp",
    "title": "RecipeBook",
    "companyName": "Cookify",
    "id": 27,
    "description": "RecipeBook by Cookify is the perfect companion for food lovers who enjoy experimenting in the kitchen. It offers a vast collection of recipes from around the world, complete with step-by-step instructions and ingredient lists. Whether you're a beginner cook or a culinary expert, RecipeBook helps you find dishes suited to your taste, dietary preferences, and cooking time.\n\nYou can save your favorite recipes, create shopping lists, and even upload your own creations to share with the community. With high-quality visuals and an easy-to-navigate design, RecipeBook makes discovering and cooking new meals an enjoyable experience. Explore global flavors and make every meal a masterpiece with RecipeBook.",
    "size": 65,
    "reviews": 1020,
    "ratingAvg": 4.6,
    "downloads": 52000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 80 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 555 }
    ]
  },
  {
    "image": "/assets/HealthTrack.jpg",
    "title": "HealthTrack",
    "companyName": "HealthifyPro",
    "id": 28,
    "description": "HealthTrack by HealthifyPro is a comprehensive wellness app designed to keep you on top of your fitness and health goals. From tracking workouts to monitoring daily steps, calories, and sleep patterns, it provides everything you need to maintain a balanced lifestyle. The app also allows you to set personalized goals based on your fitness level and preferences.\n\nWith insightful health reports, reminders, and integration with wearable devices, HealthTrack ensures you stay consistent on your wellness journey. Whether you’re aiming to lose weight, gain muscle, or simply live healthier, HealthTrack keeps you motivated every step of the way. Stay fit, stay focused, and stay on track with HealthTrack.",
    "size": 70,
    "reviews": 1000,
    "ratingAvg": 4.5,
    "downloads": 50000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 515 }
    ]
  },
  {
    "image": "/assets/demo-app (2).webp",
    "title": "WeatherNow",
    "companyName": "SkyTech",
    "id": 29,
    "description": "WeatherNow by SkyTech delivers real-time weather forecasts with unmatched accuracy. Whether you’re planning a trip, checking for rain, or monitoring severe weather alerts, WeatherNow provides all the details at a glance. Its clean interface displays temperature, humidity, wind speed, and precipitation levels in an easy-to-read format.\n\nWith dynamic visuals and location-based forecasts, WeatherNow keeps you prepared for every condition. The app also includes hourly and weekly updates, ensuring you’re never caught off guard. Simple, fast, and reliable — WeatherNow is the perfect weather companion for your daily routine.",
    "size": 45,
    "reviews": 950,
    "ratingAvg": 4.4,
    "downloads": 47000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 520 }
    ]
  },
  {
    "image": "/assets/MusicStream.jpg",
    "title": "MusicStream",
    "companyName": "Tuneify",
    "id": 30,
    "description": "MusicStream by Tuneify lets you enjoy your favorite tracks anytime, anywhere. With millions of songs across genres, curated playlists, and personalized recommendations, it offers a seamless listening experience for music lovers. Whether you’re working out, relaxing, or commuting, MusicStream sets the perfect tone for every moment.\n\nThe app provides offline downloads, high-quality audio, and smart playlists that adapt to your listening habits. Its sleek interface and smooth streaming performance make it a delight to use across all devices. Discover new artists, follow your favorites, and create playlists that match your mood — MusicStream brings your sound world to life.",
    "size": 80,
    "reviews": 1100,
    "ratingAvg": 4.6,
    "downloads": 53000,
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 575 }
    ]
  }
]
